'''
Пользоватль вводит 3 целых числа.
Найти количество положительных чисел.Вывести на экран.
'''

# q=0
# a = int(input())
# if a>0:
#     q=q+1
# a = int(input())
# if a>0:
#     q=q+1
# a = int(input())
# if a > 0:
#     q = q + 1
#     print(q)

'''
Пользователь вводит произвольное целое число.
Если оно является положительным, то к  нему прибавляется 1.
Если число ортрицпательное, то от него вычитается 2.
Результат выводится на экран.  
'''

#ф = int(input())
#if ф > 0:
#    ф=ф+1
#else:
#    ф=ф-2
#print(ф)

'''
Необходимо написать программу, которая в последовватиельности чисел определяет количество чисел больше 10.
Программа работает по следующиму алгоритму:
Вы вводите с клавиатуры последовательность целых чисел.
Их может быть неограниченное количество.
Ввод чисел останавливается чило 0.
В конце работы программы выводится количество чисел со значением больше 10
'''

# a = int(input())
# q=0
# while a!=0:
#     if a>10:
#         q=q+1
#     a = int(input())
# print(q)

'''
Найдите факториал числа
'''

#def fact(n):
#    if n <= 0:
#        return 1
#    else:
#        return n*fact(n-1)
#
#p=fact(6)
#print(p)

