'''
Дано два числа a = 10, b = 20. Вывести на экран наибольшее из чисел
'''
# a = 10
# b = 20
# if a > b:
#     print('a больше')
# else:
#     print('b больше')

'''
Сделайте проверку на отрицательные и положительные числа с помощью условий
'''
# a = int(input())
# if a >0:
#     print('Положительное')
# else:
#     print(abs(a))
#     print('Отрицательное')

'''
Пользователь вводит два числа с клавиатуры. 
Вывести на экран yes, если они отличаются друг от друга, иначе вывести на экран No
'''

# a = float(input('Введите первое число: '))
# b = float(input('Введите второе число: '))
# if abs(a-b):
#    print('Yes')
# else:
#     print('No')

'''
Дано число. Если оно больше 100 или меньше -100, то вывести на экран символ -, 
иначе вывести на экран символ +
'''

# a = int(input())
# if a <= 100 and a >= -100:
#     print('-')
# else:
#     print('+')

'''
Пользователь вводит номер месяца (от 1 до 12). Вывести название сезона года на 
экран (зима, весна, лето, осень)
'''

# m = int(input())
# if m == 12 or m == 1 or m == 2:
#     print('Зима')
# elif m == 3 or m == 4 or m == 5:
#     print('Весна')
# elif m == 6 or m == 7 or m == 8:
#     print('Лето')
# elif m == 9 or m == 10 or m == 11:
#     print('Осень')

