'''
На днях Иван у себя в прихожей выложил кафель, состоящий из квадратных черных и белых плиток.
Прихожая Ивана имеет квадратную форму 4х4, вмещающую 16 плиток. Теперь Иван переживает, что
узор из плиток, который у него получился, может быть не симпатичным. С точки зрения дизайна
симпатичным узором считается тот,
который не содержит в себе квадрата 2х2, состоящего из плиток одного цвета.
Примеры возможных узоров:
Симпатичный узор
По заданному расположению плиток в прихожей Ивана требуется определить:
является ли выполненный узор симпатичным.
'''

# a = []
# for i in range(4):
#     a.append(list(input()))
# count=0
# for i in range(3):
#     for j in range(3):
#         if a[i][j]==a[i][j+1]==a[i+1][j]==a[i+1][j+1]:
#             count+=1
# if count>0:
#     print('NO')
# else:
#     print('YES')

'''
Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
Сколько журавликов сделал каждый ребенок, если известно, что 
Петя и Сережа сделали одинаковое количество журавликов, 
а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
'''

# s = int(input())
# x=s // 6
# print(x, x*4, x)
