'''
В рождественский вечер на окошке стояло три цветочка, слева направо: герань, 
крокус и фиалка. Каждое утро Маша вытирала окошко и меняла местами стоящий справа цветок с центральным цветком. 
А Таня каждый вечер поливала цветочки и меняла местами левый и центральный цветок. Требуется определить порядок 
цветов ночью по прошествии K дней.В рождественский вечер на окошке стояло три цветочка, слева направо: герань, 
крокус и фиалка. Каждое утро Маша вытирала окошко и меняла местами стоящий справа цветок с центральным цветком. 
А Таня каждый вечер поливала цветочки и меняла местами левый и центральный цветок. 
Требуется определить порядок цветов ночью по прошествии K дней.
'''

# k = int(input())
# if k%3==0:
#     print('GVC')
# elif k%3==1:
#     print('VGC')
# else:
#     print('CVG')

'''
Вася не любит английский язык, но каждый раз старается получить хотя бы четверку за четверть, 
чтобы оставаться ударником. В текущей четверти Вася заметил следующую закономерность: по нечетным 
дням месяца он получал тройки, а по четным – четверки. Так же он помнит, в какие дни он получал эти оценки. 
Поэтому он выписал на бумажке все эти дни для того, чтобы оценить, сколько у него троек и сколько четверок. 
Помогите Васе это сделать, расположив четные и нечетные числа в разных строчках. 
Вася может рассчитывать на оценку 4, если четверок не меньше, чем троек
'''

# input()
# a = list(map(int,input().split()))
# b = []
# c = []
# for i in a:
#     if i%2==0:
#         b.append(i)
#     else:
#         c.append(i)
# print(*c)
# print(*b)
# if len(b)>=len(c):
#     print('YES')
# else:
#     print('NO')

