'''
Всем известно, что «от перестановки слагаемых сумма не изменяется». Однако, случается и
так, что перестановка двух чисел приводит к более интересным последствиям.
Пусть, например, заданы три числа: a1, a2, a3. Рассмотрим равенство a1+ a2= a3.
Оно может быть неверным (например, если a1= 1, a2= 4, a3= 3),
однако может стать верным, если поменять некоторые числа местами (например, если поменять местами a2 и a3,
оно обратится в равенство 1 + 3 = 4).
Ваша задача – по заданным трем числам определить: можно ли их переставить так, чтобы сумма первых двух равнялась третьему.'''

# a,b,c = map(int,input().split())
# if a+b==c or a+c==b or b+c==a:
#     print("YES")
# else:
#     print("NO")

'''Неспокойно сейчас на стапелях шестого дока межгалактического порта планеты Торна. 
Всего через месяц закончится реконструкция малого броненесущего корвета “Эния”. 
И снова этому боевому кораблю и его доблестной команде предстоят тяжелые бои за контроль над плутониевыми рудниками Сибелиуса. 
Работа не прекращается ни на секунду, лазерные сварочные аппараты работают круглые сутки. От непрерывной работы плавятся шарниры роботов-ремонтников. 
Но задержаться нельзя ни на секунду.
И вот в этой суматохе обнаруживается, что термозащитные панели корвета вновь требуют срочной обработки сульфидом тория. 
Известно, что на обработку одного квадратного метра панели требуется 1 нанограмм сульфида. Всего необходимо обработать N прямоугольных панелей размером A на B метров. Вам необходимо как можно скорее подсчитать, сколько всего сульфида необходимо на обработку всех панелей “Энии”. И не забудьте, что панели требуют обработки с обеих сторон.'''

# a,b,c=map(int,input().split())
# print(a*b*c*2)

'''Из книги Джонатана Свифта мы знаем, что тот Гулливер посетил страну «Лилипутию», где живут лилипуты, окруженные вещами, животными и заводами небольшого размера. 
Сначала лилипуты боялись Гулливера, но позже они поняли, что такое соседство приносит им большую выгоду, и они стали помогать ему. 
Например, лилипуты делали кровать для Гулливера из своих маленьких матрацев, сшитых вместе. Лилипутам были известны размеры Гулливера. 
Довольно быстро они смогли просчитать количество матрацев, необходимых для шитья большого матраца. 
Но у них постоянно возникали сложности с их небольшим ростом и стеля постель, они иногда не могли сшить достаточно толстый матрац'''

# a = list(map(int,input().split()))
# print(a[0]*a[0]*a[1])

'''По заданному номеру месяца в году требуется определить время года.'''

# a = int(input())
# if a == 12 or a == 1 or a ==2:
#     print('Winter')
# elif a == 3 or a == 4 or a == 5:
#     print('Spring')
# elif a == 6 or a == 7 or a == 8:
#     print('Summer')
# elif a == 9 or a == 10 or a == 11:
#     print('Autumn')
# else:
#     print('ERROR')

