'''Известны результаты каждой из 4х четвертей баскетбольной встречи. Нужно определить победителя матча. Побеждает команда, набравшая больше очков в течение всего матча.'''

# a,b = map(int,input().split())
# a1,b1 = map(int,input().split())
# a2,b2 = map(int,input().split())
# a3,b3 = map(int,input().split())
# c = a+a1+a2+a3
# c1 = b+b1+b2+b3
# if c > c1:
#     print('1')
# elif c1 < c:
#     print('2')
# else:
#     print('DRAW')

#Сделайте проверку на простое число

# a = int(input("Введите число: "))
# k = 0
# for i in range(2, a // 2+1):
#     if (a % i == 0):
#         k = k+1
# if (k <= 0):
#     print("Число простое")
# else:
#     print("Число не является простым")