'''С клавиатуры вводятся 2 целых числа a и b. Нужно вывести все числа в диапозоне от a до b
а так же указать количество этих чисел '''

# a = int(input())
# b = int(input())
# q=0
# for a in range(a,b+1):
#     print(a)
#     q=q+1
# print('кол-во чисел:',q )

'''Дано вещественное число, стоимость одного кг конфет. 
Вывести на экран стоимость 1,2 ... 10 кг конфет'''

# b = int(input())
# c=0
# for a in range (1,11):
#     cost=b*a
#     print('Стоимость',a,'кг.конфет=', c)

'''Пользователь вводит количество чисел в последовотельности, а затем сами числа.
Программа выводит сумму всех отрицательных чисел.'''

# a = int(input())
# su=0
# for a in range(1,a+1):
#     b=int(input())
#     if b<0:
#         su=su+b
# print(su)